Repository: waterlens/Hovery
Catalog: Hovery/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ Settings
zh_hans: “%@”设置

source: %@ contains native code that runs with your account’s access. Only allow it if you trust its source.
zh_hans: “%@”包含原生代码，这些代码会以你的账户权限运行。请仅在信任其来源时允许。

source: A choice needs at least one option.
zh_hans: choice 类型的设置至少需要一个选项。

source: About Hovery
zh_hans: 关于 Hovery

source: Accessibility
zh_hans: 辅助功能

source: Accessibility permission required
zh_hans: 需要“辅助功能”权限

source: Activation
zh_hans: 激活

source: Add a .hoveryextension package to the Extensions folder.
zh_hans: 将 .hoveryextension 包添加到插件文件夹。

source: Allow Hovery in Login Items to open it automatically when you log in.
zh_hans: 请在“登录项”中允许 Hovery，以便在你登录时自动打开它。

source: Allow Native Extension?
zh_hans: 要允许原生插件吗？

source: Allow and Enable
zh_hans: 允许并启用

source: Allowed
zh_hans: 已允许

source: Another extension uses %@.
zh_hans: 另一个插件已在使用标识符“%@”。

source: Apply
zh_hans: 应用

source: Approval Required
zh_hans: 需要批准

source: Block Grouping
zh_hans: 文本块分组

source: Cancel
zh_hans: 取消

source: Capture Region
zh_hans: 捕捉区域

source: Check Again
zh_hans: 再次检查

source: Choice option values must be unique.
zh_hans: choice 选项的值必须唯一。

source: Choose which extensions can show results when you hover over text.
zh_hans: 选择将指针悬停在文本上时可以显示结果的插件。

source: Click the field and press a modifier combination. Press Delete to clear it.
zh_hans: 点按此栏并按下修饰键组合。按下 Delete 键可将其清除。

source: Confidence weight
zh_hans: 置信度权重

source: Configuration Error
zh_hans: 配置错误

source: Contains Native Code
zh_hans: 包含原生代码

source: Couldn’t Save Settings
zh_hans: 无法存储设置

source: Couldn’t Update Open at Login
zh_hans: 无法更新“登录时打开”

source: Debug Overlay
zh_hans: 调试叠层

source: Debugging
zh_hans: 调试

source: Detect language automatically
zh_hans: 自动检测语言

source: Direct-hit score
zh_hans: 直接命中分数

source: Distance penalty
zh_hans: 距离惩罚

source: Done
zh_hans: 完成

source: Edge alignment tolerance
zh_hans: 边缘对齐容差

source: Enabled
zh_hans: 已启用

source: Enter a full URL, such as https://api.example.com/v1.
zh_hans: 请输入完整的 URL，例如 https://api.example.com/v1。

source: Extension Settings
zh_hans: 插件设置

source: Extension error
zh_hans: 插件错误

source: Extension resource access denied
zh_hans: 插件资源访问被拒绝

source: Extension resource does not exist: %@
zh_hans: 插件资源不存在：%@

source: Extension resource must stay inside its package: %@
zh_hans: 插件资源必须位于插件包内：%@

source: Extension resource not found
zh_hans: 找不到插件资源

source: Extensions
zh_hans: 插件

source: Extensions…
zh_hans: 插件…

source: Fallback confidence
zh_hans: 备用置信度

source: Fallback line height
zh_hans: 备用行高

source: General
zh_hans: 通用

source: Globe
zh_hans: 地球仪

source: Hold %@ to recognize text
zh_hans: 按住 %@ 以识别文本

source: Horizontal padding scale
zh_hans: 水平边距比例

source: Hover Recognition
zh_hans: 悬停识别

source: Hover Timing
zh_hans: 悬停时序

source: Hover over visible text
zh_hans: 将指针悬停在可见文本上

source: Hovery Permissions
zh_hans: Hovery 权限

source: Hovery does not capture its own windows.
zh_hans: Hovery 不会捕捉自身的窗口。

source: Hovery has the permissions required for hover recognition.
zh_hans: Hovery 已获得悬停识别所需的权限。

source: Hovery needs the following permissions before hover recognition can run.
zh_hans: Hovery 需要以下权限才能运行悬停识别。

source: Invalid extension identifier: %@
zh_hans: 无效的插件标识符：%@

source: Invalid extension network origin: %@
zh_hans: 无效的插件网络来源：%@

source: Invalid extension resource request
zh_hans: 无效的插件资源请求

# Invalid extension setting %@: %@
source: Invalid extension setting %1$@: %2$@
zh_hans: 无效的插件设置“%1$@”：%2$@

source: Keys must start with a letter and contain only letters, digits, and underscores.
zh_hans: 键必须以字母开头，且只能包含字母、数字和下划线。

source: Language
zh_hans: 语言

source: Last-resort fallback height
zh_hans: 最终备用高度

source: Last-resort fallback width
zh_hans: 最终备用宽度

source: Lets Hovery find content beneath the pointer.
zh_hans: 允许 Hovery 查找指针下的内容。

source: Lets Hovery read text beneath the pointer.
zh_hans: 允许 Hovery 读取指针下的文本。

source: Maximum candidates
zh_hans: 最大候选数

source: Maximum horizontal padding
zh_hans: 最大水平边距

source: Maximum pixel height
zh_hans: 最大像素高度

source: Maximum pixel width
zh_hans: 最大像素宽度

source: Maximum vertical gap
zh_hans: 最大垂直间距

source: Maximum vertical padding
zh_hans: 最大垂直边距

source: Minimum horizontal overlap
zh_hans: 最小水平重叠

source: Minimum line height
zh_hans: 最小行高

source: Minimum padding
zh_hans: 最小边距

source: Minimum text height
zh_hans: 最小文本高度

source: Missing extension manifest at %@
zh_hans: 缺少插件清单：%@

source: Movement tolerance
zh_hans: 移动容差

source: Nearby-hit score
zh_hans: 邻近命中分数

source: Needs Setup: %@
zh_hans: 需要设置：%@

source: No Extensions
zh_hans: 没有插件

source: No display contains the pointer.
zh_hans: 指针不在任何显示器上。

source: No modifier keys are required
zh_hans: 不需要按住修饰键

source: No text under pointer
zh_hans: 指针下没有文本

source: None
zh_hans: 无

source: Not Allowed
zh_hans: 未允许

source: OK
zh_hans: 好

source: Only choice settings can declare options.
zh_hans: 只有 choice 类型的设置可以声明选项。

source: Only number settings can declare a minimum or maximum.
zh_hans: 只有 number 类型的设置可以声明最小值或最大值。

source: Only url settings can grant network access.
zh_hans: 只有 url 类型的设置可以授予网络访问权限。

source: Open Extensions Folder
zh_hans: 打开插件文件夹

source: Open System Settings
zh_hans: 打开系统设置

source: Open TOML File
zh_hans: 打开 TOML 文件

source: Open at Login
zh_hans: 登录时打开

source: Paused
zh_hans: 已暂停

source: Permissions
zh_hans: 权限

source: Permissions…
zh_hans: 权限…

source: Pin Results
zh_hans: 固定结果

source: Pointer Hit Testing
zh_hans: 指针命中测试

source: Polling interval
zh_hans: 轮询间隔

source: Quit Hovery
zh_hans: 退出 Hovery

source: Reading…
zh_hans: 正在读取…

source: Ready
zh_hans: 就绪

source: Refresh interval
zh_hans: 刷新间隔

source: Reload
zh_hans: 重新载入

source: Request Access
zh_hans: 请求访问权限

source: Required modifiers
zh_hans: 所需修饰键

source: Required.
zh_hans: 必填。

source: Restart Hovery to use the new language.
zh_hans: 重新启动 Hovery 后生效。

source: Restart Now
zh_hans: 立即重新启动

source: Restore Defaults
zh_hans: 恢复默认设置

source: Result movement multiplier
zh_hans: 结果移动倍数

source: Same-column overlap
zh_hans: 同栏重叠

source: Save
zh_hans: 存储

source: Scan delay
zh_hans: 扫描延迟

source: Screen & System Audio Recording
zh_hans: 录屏与系统录音

source: Screen & System Audio Recording and Accessibility permissions required
zh_hans: 需要“录屏与系统录音”和“辅助功能”权限

source: Screen & System Audio Recording permission required
zh_hans: 需要“录屏与系统录音”权限

source: Screen metadata cache
zh_hans: 屏幕元数据缓存

source: Secret settings cannot declare a default value.
zh_hans: secret 类型的设置不能声明默认值。

source: Settings…
zh_hans: 设置…

source: Showing %lld semantic levels
zh_hans: 正在显示 %lld 个语义层级

source: System Language
zh_hans: 跟随系统

source: The Keychain could not store the secret: %@
zh_hans: 钥匙串无法存储机密信息：%@

source: The default value does not match the %@ type.
zh_hans: 默认值与 %@ 类型不匹配。

source: The default value is not an http, https, ws, or wss URL.
zh_hans: 默认值不是 http、https、ws 或 wss URL。

source: The default value is not one of the options.
zh_hans: 默认值不在选项之中。

source: The default value is outside the allowed range.
zh_hans: 默认值超出了允许的范围。

source: The extension %@ is no longer installed.
zh_hans: 插件“%@”已被移除。

source: The extension did not declare the %@ capability.
zh_hans: 该插件未声明“%@”功能。

source: The extension does not declare a native executable.
zh_hans: 该插件未声明原生可执行文件。

source: The extension sent an invalid capability request.
zh_hans: 该插件发送了无效的功能请求。

source: The helper must be signed by Team %@.
zh_hans: 辅助程序必须由团队 %@ 签名。

source: The key is declared more than once.
zh_hans: 该键被声明了多次。

source: The maximum must be a number.
zh_hans: 最大值必须是数字。

source: The minimum is greater than the maximum.
zh_hans: 最小值大于最大值。

source: The minimum must be a number.
zh_hans: 最小值必须是数字。

source: The native extension could not start: %@
zh_hans: 原生插件无法启动：%@

source: The native extension executable cannot be run: %@
zh_hans: 无法运行原生插件的可执行文件：%@

source: The native extension process exited.
zh_hans: 原生插件进程已退出。

source: The native extension request exceeds the configured size limit.
zh_hans: 原生插件请求超出了配置的大小限制。

source: The native extension request is not valid JSON.
zh_hans: 原生插件请求不是有效的 JSON。

source: The native extension request timed out.
zh_hans: 原生插件请求超时。

source: The native extension request was cancelled.
zh_hans: 原生插件请求已取消。

source: The native extension response exceeds the configured size limit.
zh_hans: 原生插件响应超出了配置的大小限制。

source: The native extension returned an invalid response.
zh_hans: 原生插件返回了无效的响应。

source: The native extension signature is invalid: %@
zh_hans: 原生插件的签名无效：%@

source: This extension does not provide a native helper.
zh_hans: 此插件未提供原生辅助程序。

source: Unpin Results
zh_hans: 取消固定结果

source: Unsupported native extension protocol: %@
zh_hans: 不支持的原生插件协议：%@

source: Unsupported type "%@".
zh_hans: 不支持的类型“%@”。

source: Use language correction
zh_hans: 使用语言校正

source: Uses the block under the pointer
zh_hans: 使用指针下的文本块

source: Uses the paragraph under the pointer
zh_hans: 使用指针下的段落

source: Uses the sentence under the pointer
zh_hans: 使用指针下的句子

source: Uses the word under the pointer
zh_hans: 使用指针下的单词

source: Vertical padding scale
zh_hans: 垂直边距比例

source: Vertical-center penalty
zh_hans: 垂直居中惩罚

source: Waiting
zh_hans: 正在等待

source: While results are shown, hold these keys and press 1–9 to switch between extensions.
zh_hans: 显示结果时，按住这些键再按 1–9 即可在插件之间切换。

# i18n.toml is not valid TOML at line %lld, column %lld: %@
source: i18n.toml is not valid TOML at line %1$lld, column %2$lld: %3$@
zh_hans: i18n.toml 不是有效的 TOML（第 %1$lld 行，第 %2$lld 列）：%3$@

# i18n.toml: %@ has no message in the default language, %@.
source: i18n.toml: %1$@ has no message in the default language, %2$@.
zh_hans: i18n.toml：%1$@ 在默认语言（%2$@）中没有对应的消息。

source: i18n.toml: %@ is not a setting declared in manifest.toml.
zh_hans: i18n.toml：%@ 不是 manifest.toml 中声明的设置。

source: i18n.toml: %@ is not a supported key.
zh_hans: i18n.toml：%@ 不是受支持的键。

source: i18n.toml: %@ is not a valid message key. Keys start with a letter and contain only letters, digits, and underscores.
zh_hans: i18n.toml：%@ 不是有效的消息键。键必须以字母开头，且只能包含字母、数字和下划线。

source: i18n.toml: %@ is not an option of the setting.
zh_hans: i18n.toml：%@ 不是该设置的选项。

source: i18n.toml: %@ is only supported for choice settings.
zh_hans: i18n.toml：%@ 仅适用于 choice 类型的设置。

source: i18n.toml: %@ must be a string.
zh_hans: i18n.toml：%@ 必须是字符串。

source: i18n.toml: %@ must be a table.
zh_hans: i18n.toml：%@ 必须是表。

source: i18n.toml: “%@” is not a valid language tag. Use a tag such as en, zh-Hans, or pt-BR.
zh_hans: i18n.toml：“%@”不是有效的语言标签。请使用 en、zh-Hans 或 pt-BR 等标签。

source: manifest.toml: The defaultLanguage “%@” is not a valid language tag. Use a tag such as en, zh-Hans, or pt-BR.
zh_hans: manifest.toml：defaultLanguage“%@”不是有效的语言标签。请使用 en、zh-Hans 或 pt-BR 等标签。

source: s
zh_hans: 秒

source: × line
zh_hans: × 行高
